#pragma once // include guard

// ============================================================
// ІНІЦІАЛІЗАЦІЯ КНОПКИ
// ============================================================


void initButton(); // Налаштування GPIO кнопки

void initWiFiDisconnectButton(); // Ініціалізація тестової кнопки Wi-Fi Disconnect

// ============================================================
// ОБРОБКА КНОПКИ
// ============================================================

// Перевіряє натискання кнопки з урахуванням debounce

bool isButtonPressed();  // Повертає true один раз при кожному натисканні
bool isWiFiDisconnectButtonPressed(); // Повертає true один раз при кожному натисканні тестової кнопки Wi-Fi Disconnect