#pragma once // include guard

// ============================================================
// ІНІЦІАЛІЗАЦІЯ КНОПКИ
// ============================================================


void initButton(); // Налаштування GPIO кнопки

// ============================================================
// ОБРОБКА КНОПКИ
// ============================================================

// Перевіряє натискання кнопки з урахуванням debounce

bool isButtonPressed();  // Повертає true один раз при кожному натисканні