#pragma once // include guard

// ============================================================
// КОНФІГУРАЦІЯ ПІНІВ
// ============================================================

#define DHT_PIN       4 // DHT22 сенсор підключений до GPIO4
#define BUTTON_PIN    14 // Кнопка підключена до GPIO14

#define DHT_TYPE      DHT22 // Задаємо тип сенсора DHT22

// ═══════════════════════════════════════════════════════════
// КОНФІГУРАЦІЯ WI-FI
// ═══════════════════════════════════════════════════════════
#define WIFI_SSID     "Wokwi-GUEST"  // мережа Wokwi симулятора
#define WIFI_PASSWORD ""              // без пароля
#define WIFI_TIMEOUT  10000           // максимум 10 секунд на підключення