#pragma once // include guard

#include <Arduino.h>

// ============================================================
// БІТИ СТАНУ ПРИСТРОЮ
// ============================================================

#define STATUS_OK        0b00000000
#define STATUS_DHT_ERR   0b00000001
#define STATUS_WIFI_ERR  0b00000010
#define STATUS_MQTT_ERR  0b00000100

// ============================================================
// ДАНІ DHT22
// ============================================================

struct DHTData {
    float temperature; // Температура в градусах Цельсія, °C
    float humidity; // Вологість в відсотках, %
};

// ============================================================
// ЗАГАЛЬНИЙ ПАКЕТ ДАНИХ
// ============================================================

struct SensorData {
    DHTData dht; // Дані з DHT22 сенсора

    unsigned long timestamp; // Час зчитування даних у мілісекундах (millis())
    uint8_t statuscheck; // Статус пристрою (OK, помилки сенсорів, помилки Wi-Fi)
};
