#pragma once // include guard

// ============================================================
// ІНІЦІАЛІЗАЦІЯ СВІТЛОДІОДА
// ============================================================

void initActuator();

// ============================================================
// КЕРУВАННЯ СВІТЛОДІОДОМ
// ============================================================

void updateLEDByTemperature(float temperature); // Керування станом світлодіода залежно від температури

bool getLEDState(); // Повертає поточний стан світлодіода

void startManualBlink(); // Запуск триразового мигання LED

void actuatorLoop(); // Обслуговування процесу мигання LED