#pragma once // include guard

// ============================================================
// КОНФІГУРАЦІЯ ПІНІВ
// ============================================================

#define LED_PIN 2 // Світлодіод підключений до GPIO2

// ============================================================
// НАЛАШТУВАННЯ МИГАННЯ LED
// ============================================================

#define LED_BLINK_INTERVAL 250 // Інтервал між перемиканнями LED, мс
#define LED_BLINK_COUNT    3   // Кількість мигань

// ============================================================
// ПОРОГИ ТЕМПЕРАТУРИ
// ============================================================

#define TEMPERATURE_LED_ON  26.0 // Температура вище 26 °C - світлодіод вмикається
#define TEMPERATURE_LED_OFF 20.0 // Температура нижче 20 °C - світлодіод вимикається

// ═══════════════════════════════════════════════════════════
// КОНФІГУРАЦІЯ WI-FI
// ═══════════════════════════════════════════════════════════
#define WIFI_SSID     "Wokwi-GUEST"  // мережа Wokwi симулятора
#define WIFI_PASSWORD ""             // без пароля
#define WIFI_TIMEOUT  10000          // Час очікування підключення до WI-FI

// ═══════════════════════════════════════════════════════════
// КОНФІГУРАЦІЯ MQTT
// ═══════════════════════════════════════════════════════════

#define MQTT_BROKER    "broker.hivemq.com"   // Адреса брокера
#define MQTT_PORT      1883                  // Порт брокера
#define MQTT_CLIENT_ID "ESP32-Tregubenko-B"  // Ідентифікатор клієнта

#define MQTT_RETRY_DELAY 5000 // Інтервал між спробами reconnect, мс
#define MQTT_MAX_RETRIES 3    // Максимальна кількість спроб reconnect

#define MQTT_KEEPALIVE_SEC      60 // Інтервал keep-alive в секундах
#define MQTT_SOCKET_TIMEOUT_SEC 30 // Таймаут сокета в секундах

// ============================================================
// MQTT ТОПІКИ
// ============================================================

#define MQTT_TOPIC_TEMPERATURE "iot-course/Tregubenko/sensors/temperature" // Топік для отримання температури
#define MQTT_TOPIC_COMMANDS    "iot-course/Tregubenko/commands"            // Топік для отримання команд від користувача
#define MQTT_TOPIC_LED "iot-course/Tregubenko/actuators/led"               // Топік для публікації стану світлодіода
#define MQTT_TOPIC_STATUS "iot-course/Tregubenko/status"                   // Топік стану ESP32-B

