#pragma once // include guard

// ============================================================
// КОНФІГУРАЦІЯ MQTT-КЛІЄНТА
// ============================================================

void initMQTT(); // Налаштування параметрів MQTT-клієнта

// ============================================================
// ПІДКЛЮЧЕННЯ ДО WI-FI
// ============================================================

bool connectWiFi(); // Підключення ESP32 до Wi-Fi

// ============================================================
// ОБСЛУГОВУВАННЯ WI-FI
// ============================================================

void wifiLoop(); // Обслуговування Wi-Fi-з'єднання та повторне підключення при втраті з'єднання

// ============================================================
// ПІДКЛЮЧЕННЯ ДО MQTT
// ============================================================

bool connectMQTT(); // Підключення до MQTT-брокера

// ============================================================
// ОБСЛУГОВУВАННЯ MQTT
// ============================================================

void mqttLoop(); // Обслуговування MQTT-з'єднання та вхідних повідомлень

// ============================================================
// ОТРИМАНІ ДАНІ
// ============================================================

// Перевіряє, чи отримано нове значення температури.
bool getReceivedTemperature(float &temperature); // Якщо отримано - записує його у temperature та повертає true.

// Перевіряє, чи отримано команду manual_read.
bool getManualReadCommand(); // Повертає true один раз для кожної отриманої команди.

// ============================================================
// ПУБЛІКАЦІЯ СТАНУ LED
// ============================================================

bool publishLEDState(bool state); // Публікація стану LED на MQTT-топік. Повертає true, якщо публікація успішна.