#pragma once // include guard

// ============================================================
// ПІДКЛЮЧЕННЯ ДО WI-FI
// ============================================================

bool connectWiFi(); // Підключення ESP32 до Wi-Fi

// ============================================================
// ПІДКЛЮЧЕННЯ ДО MQTT
// ============================================================

bool connectMQTT(); // Підключення до MQTT-брокера

// ============================================================
// ОБСЛУГОВУВАННЯ MQTT
// ============================================================

void mqttLoop(); // Обслуговування MQTT-з'єднання та вхідних повідомлень

// ============================================================
// ОТРИМАНІ ДАНІ
// ============================================================

// Перевіряє, чи отримано нове значення температури.
bool getReceivedTemperature(float &temperature); // Якщо отримано - записує його у temperature та повертає true.

// Перевіряє, чи отримано команду manual_read.
bool getManualReadCommand(); // Повертає true один раз для кожної отриманої команди.